'''
1.所有需要对比的文案字段 均以txt开头，txt1，txt2....
2.所有当前所在模块的字段均为name开头，name1，name2...

'''
# import re
# from Csrc_tobelist import New_rename
#
import pypinyin
def a():
#     lists = New_rename.Open.lists
#     s= '交易对手风险、关联交易风险、指标风险、法律风险、舆情风险、披露合规分析、结构风险、智能预警风险、财务异常'
#     g = s.split('、')
#     print(g[0])
#     print(g[1])
#     print(g[2])
#     print(g[3])
#     print(g[4])
#     print(g[5])
#     print(g[6])
#     print(g[7])
#     print(g[8])
#
#
#
    # s =('序号\n'
    #     '拟上市公司名称\n'
    #     '拟上市板块\n'
    #     '总体风险程度\n'
    #     '交易对手风险\n'
    #     '关联交易风险\n'
    #     '指标风险\n'
    #     '财务异常\n'
    #     '智能预警风险\n'
    #     '法律风险\n'
    #     '舆情风险\n'
    #     '结构风险\n')
    # print(s)
    # r = s.replace('序号\n'
    #               '拟上市公司名称\n'
    #               '拟上市板块\n'
    #               '总体风险程度\n','')
    # # l = re.sub(r'.+[查看详情]','',s)
    # print(r)
    ll = [
        "安信证券股份有限公司",
        "中信建投证券股份有限公司",
        "光大证券股份有限公司",
        "浙商证券股份有限公司",
        "中信证券股份有限公司",
        "华泰联合证券有限责任公司",
        "国金证券股份有限公司",
        "中国国际金融股份有限公司",
        "东方花旗证券有限公司",
        "第一创业证券承销保荐有限责任公司",
        "民生证券股份有限公司",
        "东兴证券股份有限公司",
        "海通证券股份有限公司",
        "中原证券股份有限公司",
        "英大证券有限责任公司",
        "东吴证券股份有限公司",
        "瑞信方正证券有限责任公司",
        "华英证券有限责任公司",
        "财通证券股份有限公司",
        "兴业证券股份有限公司",
        "国信证券股份有限公司",
        "中国国际金融股份有限公司、中邮证券有限责任公司",
        "长城证券股份有限公司",
        "华创证券有限责任公司",
        "红塔证券股份有限公司",
        "国元证券股份有限公司",
        "中天国富证券有限公司",
        "长江证券承销保荐有限公司",
        "华林证券股份有限公司",
        "联储证券有限责任公司",
        "国泰君安证券股份有限公司",
        "中德证券有限责任公司"
        ]
    print(sorted(ll, key=lambda x: hanzi_to_pinyin(x[0]),reverse=True))

def hanzi_to_pinyin(last_name):
    """
    功能说明：将姓名转换为拼音首字母缩写
    参数：hanzi_to_pinyin(u'习大大')
    返回值：xdd
    """
    rows = pypinyin.pinyin(last_name, style=pypinyin.NORMAL)  # 获取姓氏首字母
    return ''.join(row[0][0] for row in rows if len(row) > 0)   # 拼接姓名首字母字符串

a()

