'''
1.所有需要对比的文案字段 均以txt开头，txt1，txt2....
2.所有当前所在模块的字段均为name开头，name1，name2...

'''
import re
def a():
#     s= '交易对手风险、关联交易风险、指标风险、法律风险、舆情风险、披露合规分析、结构风险、智能预警风险、财务异常'
#     g = s.split('、')
#     print(g[0])
#     print(g[1])
#     print(g[2])
#     print(g[3])
#     print(g[4])
#     print(g[5])
#     print(g[6])
#     print(g[7])
#     print(g[8])
#
#
#
    s =('交易对手风险\n'
    '关联交易风险\n'
    '查看详情指标风险\n'
    '查看详情财务异常\n'
    '查看详情智能预警风险\n'
    '查看详情法律风险\n'
    '查看详情舆情风险\n'
    '查看详情披露合规分析\n'
    '查看详情结构风险\n'
    '查看详情')
    #print(s)
    # r = s.replace('查看详情','')
    # l = re.sub(r'.+[查看详情]','',s)
    # print(r)

a()